bench/results/redis/fsBrev_mt_r1-1_d100_P1.out
Json file fsBrev_mt_r1-1_d100_P1.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 101%,  20 secs]  0 threads  4 conns:     1379297 ops,   68591 (avg:   68452) ops/sec, 8.77MB/sec (avg: 7.76MB/sec),  0.06 (avg:  0.12) msec latency

warning: GET miss rate 47.34% above target 1.00% (326509 misses / 689646 ops)

CPU Utilization Summary
  Total CPU time:   14.985s  (user 5.786s, sys 9.199s)
  Wall time:        20.150s
  Cores used:       0.744   (avg 37.2% across 2 worker threads)
  Peak utilization: 106.4%
Saving JSON output file: fsBrev_mt_r1-1_d100_P1.json
Json file closed.
2         Threads
4         Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        34226.31          ---          ---         0.12361         0.06300         0.09500         0.13500      4872.54 
Gets        34226.06     18021.93     16204.13         0.10926         0.06300         0.09500         0.12700      3075.40 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      68452.37     18021.93     16204.13         0.11644         0.06300         0.09500         0.13500      7947.94