bench/results/redis/fsBrev_mt_r1-1_d100_P16.out
Json file fsBrev_mt_r1-1_d100_P16.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 101%,  20 secs]  0 threads  4 conns:     2480832 ops,  126369 (avg:  123086) ops/sec, 17.00MB/sec (avg: 15.98MB/sec),  1.02 (avg:  1.04) msec latency

warning: GET miss rate 13.88% above target 1.00% (172183 misses / 1240416 ops)

CPU Utilization Summary
  Total CPU time:   3.889s  (user 2.653s, sys 1.236s)
  Wall time:        20.156s
  Cores used:       0.193   (avg 9.6% across 2 worker threads)
  Peak utilization: 20.4%
Saving JSON output file: fsBrev_mt_r1-1_d100_P16.json
Json file closed.
2         Threads
4         Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        61543.09          ---          ---         1.03570         0.37500         0.50300       518.14300      8761.37 
Gets        61543.09     53000.25      8542.84         1.03570         0.37500         0.50300       518.14300      7601.58 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     123086.19     53000.25      8542.84         1.03570         0.37500         0.50300       518.14300     16362.95