bench/results/redis/fsBrev_mt_r1-1_d1024_P1.out
Json file fsBrev_mt_r1-1_d1024_P1.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  20 secs]  0 threads  4 conns:      922939 ops,   52991 (avg:   45989) ops/sec, 46.52MB/sec (avg: 34.80MB/sec),  0.07 (avg:  0.17) msec latency

warning: GET miss rate 4.25% above target 1.00% (19612 misses / 461468 ops)

CPU Utilization Summary
  Total CPU time:   11.449s  (user 4.545s, sys 6.904s)
  Wall time:        20.070s
  Cores used:       0.570   (avg 28.5% across 2 worker threads)
  Peak utilization: 68.0%
Saving JSON output file: fsBrev_mt_r1-1_d1024_P1.json
Json file closed.
2         Threads
4         Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        22994.91          ---          ---         0.17079         0.07100         0.11100         0.20700     24045.38 
Gets        22994.76     22017.50       977.26         0.17616         0.06300         0.10300         0.19100     11587.82 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      45989.67     22017.50       977.26         0.17348         0.07100         0.11100         0.19900     35633.21