bench/results/redis/fsBrev_mt_r1-1_d1024_P16.out
Json file fsBrev_mt_r1-1_d1024_P16.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  20 secs]  0 threads  4 conns:     1338755 ops,   65018 (avg:   66612) ops/sec, 60.59MB/sec (avg: 59.25MB/sec),  1.97 (avg:  1.95) msec latency

warning: GET miss rate 4.26% above target 1.00% (28497 misses / 669376 ops)

CPU Utilization Summary
  Total CPU time:   4.206s  (user 2.034s, sys 2.172s)
  Wall time:        20.553s
  Cores used:       0.205   (avg 10.2% across 2 worker threads)
  Peak utilization: 26.0%
Saving JSON output file: fsBrev_mt_r1-1_d1024_P16.json
Json file closed.
2         Threads
4         Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        33197.10          ---          ---         1.94654         0.61500         0.87900       610.30300     34713.65 
Gets        33196.95     31783.83      1413.12         1.94584         0.61500         0.87900       610.30300     25761.57 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      66394.05     31783.83      1413.12         1.94619         0.61500         0.87900       610.30300     60475.21