bench/results/redis/fsBrev_mt_r1-9_d100_P1.out
Json file fsBrev_mt_r1-9_d100_P1.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 101%,  20 secs]  0 threads  4 conns:     1819488 ops,   77394 (avg:   89725) ops/sec, 38.87MB/sec (avg: 60.39MB/sec),  0.06 (avg:  0.09) msec latency

warning: GET miss rate 2.37% above target 1.00% (38831 misses / 1637535 ops)

CPU Utilization Summary
  Total CPU time:   20.583s  (user 8.161s, sys 12.422s)
  Wall time:        20.279s
  Cores used:       1.015   (avg 50.7% across 2 worker threads)
  Peak utilization: 151.1%
Saving JSON output file: fsBrev_mt_r1-9_d100_P1.json
Json file closed.
2         Threads
4         Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         8972.74          ---          ---         0.09515         0.06300         0.10300         0.16700      1277.37 
Gets        80752.63     78837.73      1914.89         0.08803         0.06300         0.10300         0.16700     60564.87 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      89725.37     78837.73      1914.89         0.08874         0.06300         0.10300         0.16700     61842.23