bench/results/redis/fsBrev_mt_r1-9_d100_P16.out
Json file fsBrev_mt_r1-9_d100_P16.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 101%,  20 secs]  0 threads  4 conns:     3128624 ops,  140968 (avg:  155275) ops/sec, 56.23MB/sec (avg: 78.46MB/sec),  0.42 (avg:  0.82) msec latency

warning: GET miss rate 2.76% above target 1.00% (77621 misses / 2815757 ops)

CPU Utilization Summary
  Total CPU time:   9.637s  (user 4.436s, sys 5.200s)
  Wall time:        20.149s
  Cores used:       0.478   (avg 23.9% across 2 worker threads)
  Peak utilization: 80.2%
Saving JSON output file: fsBrev_mt_r1-9_d100_P16.json
Json file closed.
2         Threads
4         Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        15527.47          ---          ---         0.84126         0.44700         0.53500         2.30300      2210.50 
Gets       139745.24    135892.92      3852.32         0.81996         0.44700         0.53500         1.81500     78129.56 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     155272.71    135892.92      3852.32         0.82209         0.44700         0.53500         1.83900     80340.06