bench/results/redis/fsBrev_mt_r1-9_d1024_P16.out
Json file fsBrev_mt_r1-9_d1024_P16.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 102%,  20 secs]  0 threads  4 conns:     2589334 ops,  186168 (avg:  126587) ops/sec, 159.48MB/sec (avg: 101.12MB/sec),  0.98 (avg:  1.01) msec latency

warning: GET miss rate 2.11% above target 1.00% (49193 misses / 2330398 ops)

CPU Utilization Summary
  Total CPU time:   9.521s  (user 4.109s, sys 5.412s)
  Wall time:        20.456s
  Cores used:       0.465   (avg 23.3% across 2 worker threads)
  Peak utilization: 72.2%
Saving JSON output file: fsBrev_mt_r1-9_d1024_P16.json
Json file closed.
2         Threads
4         Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        12658.49          ---          ---         1.00415         0.51100         0.64700         2.46300     13236.73 
Gets       113924.50    111519.89      2404.61         1.00979         0.51100         0.64700         2.46300     90309.29 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     126582.99    111519.89      2404.61         1.00923         0.51100         0.64700         2.46300    103546.02